In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv('pets.csv')
print(len(dataframe))

3

In [4]:
dataframe.head()

       name   color  age      treat
0     felix   black   80    spinach
1  garfield  orange    7  newspaper
2      maru   brown    3      mouse

In [5]:
my_dict = { 
     'name' : ["a", "b", "c", "d", "e","f", "g"],
     'age' : [20,27, 35, 55, 18, 21, 35],
     'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]
}

In [6]:
my_dict

{'name': ['a', 'b', 'c', 'd', 'e', 'f', 'g'],
 'age': [20, 27, 35, 55, 18, 21, 35],
 'designation': ['VP', 'CEO', 'CFO', 'VP', 'VP', 'CEO', 'MD']}

In [7]:
df2 = pd.DataFrame(my_dict)

In [8]:
df2

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [12]:
df2.to_csv('my_dict_csv_example2')

In [13]:
df2

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [17]:
pd.read_csv('my_dict_csv_example.csv')

   Unnamed: 0 name  age designation
0           0    a   20          VP
1           1    b   27         CEO
2           2    c   35         CFO
3           3    d   55          VP
4           4    e   18          VP
5           5    f   21         CEO
6           6    g   35          MD

In [18]:
pd.read_csv('pets.csv')

       name   color  age      treat
0     felix   black   80    spinach
1  garfield  orange    7  newspaper
2      maru   brown    3      mouse